//#include <iostream>
//using namespace std;
//int main(int argc, char const* argv[]) {
//	int A, B;
//	cin >> A >> B;
//	cout << ((A / 100) * (B % 10) + ((A / 10) % 10) * (B % 10) / 10) * 100 + (((A % 10) * (B % 10)) / 10 + ((A / 10) % 10) * (B % 10) % 10) * 10 + ((A % 10) * (B % 10)) % 10 << "\n";
//	cout << ((A / 100) * (B / 10 % 10) + ((A / 10) % 10) * (B / 10 % 10) / 10) * 100 + (((A % 10) * (B / 10 % 10)) / 10 + ((A / 10) % 10) * (B / 10 % 10) % 10) * 10 + (((A % 10) * (B / 10 % 10)) % 10) << "\n";
//	cout << ((A / 100) * (B / 100) + ((A / 10) % 10) * (B / 100) / 10) * 100 + (((A % 10) * (B / 100)) / 10 + ((A / 10) % 10) * (B / 100) % 10) * 10 + (((A % 10) * (B / 100)) % 10) << "\n";
//	cout << (((A / 100) * (B / 100) + ((A / 10) % 10) * (B / 100) / 10) * 100 + (((A % 10) * (B / 100)) / 10 + ((A / 10) % 10) * (B / 100) % 10) * 10 + (((A % 10) * (B / 100)) % 10)) * 100 + (((A / 100) * (B / 10 % 10) + ((A / 10) % 10) * (B / 10 % 10) / 10) * 100 + (((A % 10) * (B / 10 % 10)) / 10 + ((A / 10) % 10) * (B / 10 % 10) % 10) * 10 + (((A % 10) * (B / 10 % 10)) % 10)) * 10 + (((A / 100) * (B % 10) + ((A / 10) % 10) * (B % 10) / 10) * 100 + (((A % 10) * (B % 10)) / 10 + ((A / 10) % 10) * (B % 10) % 10) * 10 + ((A % 10) * (B % 10)) % 10) << "\n";
//	return 0;
//}

//#include <iostream>
//#include <cstdlib> // atoi 함수가 선언된 헤더파일
//using namespace std;
//int main(int argc, char const* argv[]) {
//	int A;
//	char B[4];
//	cin >> A;
//	cin >> B;
//
//	// cout << B[0] << B[1] << B[2] << "\n"; // -> B[0] : 3, B[1] : 8, B[2] : 5
//
//	cout << A * (B[2] - '0') << "\n"; // -> - '0'을 해 주는 이유는 문자로 저장된 5를 숫자 5로 바꿔주기 위함
//	cout << A * (B[1] - '0') << "\n";
//	cout << A * (B[0] - '0') << "\n";
//	cout << A * atoi(B) << "\n"; // atoi : 문자를 숫자로 바꿔줌
//
//	return 0;
//}

#include <iostream>
using namespace std;
int main(int argc, char const* argv[]) {
	int A, B;
	cin >> A >> B;
	cout << A * (B % 10) << "\n";
	cout << A * (B % 100 / 10) << "\n";
	cout << A * (B / 100) << "\n";
	cout << A * B << "\n";
	return 0;
}